ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ПараметрыЦенообразования/ЖБИ_ПараметрыЦенообразования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_ПараметрыЦенообразования</name>
  <comment>ЖБИ - Параметры ценообразования</comment>
  <resources>
    <name>ПроцентНаценки</name>
    <comment>% наценки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПовышающийПроцент</name>
    <comment>Транспортный %</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимаяСкидка</name>
    <comment>Допус. скидка %</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПовышеннаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/CommonModules/ЖБИ_ОбщийМодульДокументыСервер/Module.bsl
#Область СлужебныеПроцедурыИФункци

Функция ОпределитьДоступностьРоли(Имя)	Экспорт 
	Результат = РольДоступна(Имя);
	Возврат Результат;
КонецФункции

#КонецОбласти


#Область ЖБИ_ЗаявкиПокупателей

Функция ДобавитьКомментарийВЧатСервер(СтруктураЗаписиЧата, СообщениеОбОшибки) Экспорт
	
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_Чат.ПолучитьПустуюТаблицуНаборЗаписей();
	НоваяСтр = ТаблицаНабораЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтр,СтруктураЗаписиЧата);
	Результат = РегистрыСведений.ЖБИ_Чат.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибки);
	
	Возврат Результат;
		
КонецФункции

Функция ПроверитьДопустимуюСкидкуПоставщика(Поставщик,Процент,СообщениеОбОшибки) Экспорт 
	
	Отказ = Ложь;	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ЖБИ_ПараметрыЦенообразования.ДопустимаяСкидка, 0) КАК ДопустимаяСкидка
	               |ИЗ
	               |	РегистрСведений.ЖБИ_ПараметрыЦенообразования КАК ЖБИ_ПараметрыЦенообразования
	               |ГДЕ
	               |	ЖБИ_ПараметрыЦенообразования.Партнер = &Поставщик";	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		ДопустимаяСкидка = РезультатЗапроса.ДопустимаяСкидка;
		Если ДопустимаяСкидка>0
			И Процент > ДопустимаяСкидка Тогда 
			СообщениеОбОшибки = "Допустимый %скидки поставщика равен "+ДопустимаяСкидка;
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти
